Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_310 (Conv2D)          (None, 252, 252, 30)      2280      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 126, 126, 30)      0         
_________________________________________________________________
conv2d_311 (Conv2D)          (None, 124, 124, 16)      4336      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 62, 62, 16)        0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 62, 62, 16)        0         
_________________________________________________________________
flatten (Flatten)            (None, 61504)             0         
_________________________________________________________________
dense_6 (Dense)              (None, 128)               7872640   
_________________________________________________________________
dense_7 (Dense)              (None, 3)                 387       
=================================================================
Total params: 7,879,643
Trainable params: 7,879,643
Non-trainable params: 0
_________________________________________________________________
