Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
model_2 (Functional)         (None, 8, 8, 2048)        28513520  
_________________________________________________________________
global_average_pooling2d_2 ( (None, 2048)              0         
_________________________________________________________________
dense_24 (Dense)             (None, 1024)              2098176   
_________________________________________________________________
dropout_10 (Dropout)         (None, 1024)              0         
_________________________________________________________________
dense_25 (Dense)             (None, 512)               524800    
_________________________________________________________________
dropout_11 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_26 (Dense)             (None, 3)                 1539      
=================================================================
Total params: 31,138,035
Trainable params: 3,677,187
Non-trainable params: 27,460,848
_________________________________________________________________
